---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.HandRail
source: html/b4474953-5e46-7f1c-a72e-131f4d6d10d1.htm
---
# HandRail Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.